const data = [
  {
    "name": "铁块",
    "type": "组件"
  },
  {
    "name": "铜块",
    "type": "组件"
  },
  {
    "name": "高纯硅块",
    "type": "组件"
  },
  {
    "name": "钛块",
    "type": "组件"
  },
  {
    "name": "石材",
    "type": "组件"
  },
  {
    "name": "高级石墨",
    "type": "组件"
  },
  {
    "name": "精炼油",
    "type": "组件"
  },
  {
    "name": "塑料",
    "type": "组件"
  },
  {
    "name": "石墨烯",
    "type": "组件"
  },
  {
    "name": "增产剂Mk.Ⅰ",
    "type": "组件"
  },
  {
    "name": "增产剂Mk.Ⅱ",
    "type": "组件"
  },
  {
    "name": "增产剂Mk.Ⅲ",
    "type": "组件"
  },
  {
    "name": "磁铁",
    "type": "组件"
  },
  {
    "name": "磁线圈",
    "type": "组件"
  },
  {
    "name": "晶格硅",
    "type": "组件"
  },
  {
    "name": "钛合金",
    "type": "组件"
  },
  {
    "name": "玻璃",
    "type": "组件"
  },
  {
    "name": "金刚石",
    "type": "组件"
  },
  {
    "name": "有机晶体",
    "type": "组件"
  },
  {
    "name": "液氢燃料棒",
    "type": "组件"
  },
  {
    "name": "氘核燃料棒",
    "type": "组件"
  },
  {
    "name": "反物质燃料棒",
    "type": "组件"
  },
  {
    "name": "钢材",
    "type": "组件"
  },
  {
    "name": "电动机",
    "type": "组件"
  },
  {
    "name": "钛化玻璃",
    "type": "组件"
  },
  {
    "name": "棱镜",
    "type": "组件"
  },
  {
    "name": "钛晶石",
    "type": "组件"
  },
  {
    "name": "推进器",
    "type": "组件"
  },
  {
    "name": "加力推进器",
    "type": "组件"
  },
  {
    "name": "奇异物质",
    "type": "组件"
  },
  {
    "name": "齿轮",
    "type": "组件"
  },
  {
    "name": "电磁涡轮",
    "type": "组件"
  },
  {
    "name": "硅石",
    "type": "组件"
  },
  {
    "name": "电路板",
    "type": "组件"
  },
  {
    "name": "引力透镜",
    "type": "组件"
  },
  {
    "name": "硫酸",
    "type": "组件"
  },
  {
    "name": "重氢",
    "type": "组件"
  },
  {
    "name": "位面过滤器",
    "type": "组件"
  },
  {
    "name": "碳纳米管",
    "type": "组件"
  },
  {
    "name": "物流运输机",
    "type": "组件"
  },
  {
    "name": "星际物流运输机",
    "type": "组件"
  },
  {
    "name": "小型运载火箭",
    "type": "组件"
  },
  {
    "name": "电浆激发器",
    "type": "组件"
  },
  {
    "name": "超级磁场环",
    "type": "组件"
  },
  {
    "name": "粒子带宽",
    "type": "组件"
  },
  {
    "name": "处理器",
    "type": "组件"
  },
  {
    "name": "卡西米尔晶体",
    "type": "组件"
  },
  {
    "name": "粒子容器",
    "type": "组件"
  },
  {
    "name": "空间翘曲器",
    "type": "组件"
  },
  {
    "name": "湮灭约束球",
    "type": "组件"
  },
  {
    "name": "太阳帆",
    "type": "组件"
  },
  {
    "name": "框架材料",
    "type": "组件"
  },
  {
    "name": "戴森球组件",
    "type": "组件"
  },
  {
    "name": "光子合并器",
    "type": "组件"
  },
  {
    "name": "微晶元件",
    "type": "组件"
  },
  {
    "name": "量子芯片",
    "type": "组件"
  },
  {
    "name": "临界光子",
    "type": "组件"
  },
  {
    "name": "蓝矩阵",
    "type": "组件"
  },
  {
    "name": "红矩阵",
    "type": "组件"
  },
  {
    "name": "黄矩阵",
    "type": "组件"
  },
  {
    "name": "紫矩阵",
    "type": "组件"
  },
  {
    "name": "绿矩阵",
    "type": "组件"
  },
  {
    "name": "宇宙矩阵",
    "type": "组件"
  },
  {
    "name": "地基",
    "type": "组件"
  },
  {
    "name": "光栅石",
    "type": "组件"
  },
  {
    "name": "分形硅石",
    "type": "组件"
  },
  {
    "name": "刺笋结晶",
    "type": "组件"
  },
  {
    "name": "单极磁石",
    "type": "组件"
  },
  {
    "name": "原油",
    "type": "组件"
  },
  {
    "name": "反物质",
    "type": "组件"
  },
  {
    "name": "可燃冰",
    "type": "组件"
  },
  {
    "name": "木",
    "type": "组件"
  },
  {
    "name": "氢",
    "type": "组件"
  },
  {
    "name": "水",
    "type": "组件"
  },
  {
    "name": "沙子",
    "type": "组件"
  },
  {
    "name": "煤矿",
    "type": "组件"
  },
  {
    "name": "石矿",
    "type": "组件"
  },
  {
    "name": "蓄电池满",
    "type": "组件"
  },
  {
    "name": "金伯利矿石",
    "type": "组件"
  },
  {
    "name": "钛石",
    "type": "组件"
  },
  {
    "name": "铁矿",
    "type": "组件"
  },
  {
    "name": "铜矿",
    "type": "组件"
  },
  {
    "name": "电力感应塔",
    "type": "建筑"
  },
  {
    "name": "无线输电塔",
    "type": "建筑"
  },
  {
    "name": "卫星配电站",
    "type": "建筑"
  },
  {
    "name": "风力涡轮机",
    "type": "建筑"
  },
  {
    "name": "火力发电机",
    "type": "建筑"
  },
  {
    "name": "太阳能板",
    "type": "建筑"
  },
  {
    "name": "蓄电池",
    "type": "建筑"
  },
  {
    "name": "地热发电站",
    "type": "建筑"
  },
  {
    "name": "微型聚变发电站",
    "type": "建筑"
  },
  {
    "name": "能量枢纽",
    "type": "建筑"
  },
  {
    "name": "射线接收站",
    "type": "建筑"
  },
  {
    "name": "人造恒星",
    "type": "建筑"
  },
  {
    "name": "传送带",
    "type": "建筑"
  },
  {
    "name": "高速传送带",
    "type": "建筑"
  },
  {
    "name": "极速传送带",
    "type": "建筑"
  },
  {
    "name": "四向分流器",
    "type": "建筑"
  },
  {
    "name": "自动集装机",
    "type": "建筑"
  },
  {
    "name": "流速监测器",
    "type": "建筑"
  },
  {
    "name": "小型储物仓",
    "type": "建筑"
  },
  {
    "name": "大型储物仓",
    "type": "建筑"
  },
  {
    "name": "储液灌",
    "type": "建筑"
  },
  {
    "name": "行星内物流运输站",
    "type": "建筑"
  },
  {
    "name": "星际物流运输站",
    "type": "建筑"
  },
  {
    "name": "轨道采集器",
    "type": "建筑"
  },
  {
    "name": "分拣器",
    "type": "建筑"
  },
  {
    "name": "高速分拣器",
    "type": "建筑"
  },
  {
    "name": "极速分拣器",
    "type": "建筑"
  },
  {
    "name": "采矿机",
    "type": "建筑"
  },
  {
    "name": "大型采矿机",
    "type": "建筑"
  },
  {
    "name": "抽水机",
    "type": "建筑"
  },
  {
    "name": "原油萃取站",
    "type": "建筑"
  },
  {
    "name": "原油精炼厂",
    "type": "建筑"
  },
  {
    "name": "分馏塔",
    "type": "建筑"
  },
  {
    "name": "微型粒子对撞机",
    "type": "建筑"
  },
  {
    "name": "电磁轨道弹射器",
    "type": "建筑"
  },
  {
    "name": "垂直发射井",
    "type": "建筑"
  },
  {
    "name": "制作台Mk.Ⅰ",
    "type": "建筑"
  },
  {
    "name": "制作台Mk.Ⅱ",
    "type": "建筑"
  },
  {
    "name": "制作台Mk.Ⅲ",
    "type": "建筑"
  },
  {
    "name": "电弧熔炉",
    "type": "建筑"
  },
  {
    "name": "位面熔炉",
    "type": "建筑"
  },
  {
    "name": "喷涂机",
    "type": "建筑"
  },
  {
    "name": "化工厂",
    "type": "建筑"
  },
  {
    "name": "矩阵研究站",
    "type": "建筑"
  }
]